In [1]:
import os

In [2]:
os.getcwd()

'd:\\MLOps\\book-recommendation\\experiments'

In [3]:
os.chdir("../")

In [4]:
os.getcwd()

'd:\\MLOps\\book-recommendation'

In [5]:
data_path="data"

In [6]:
import pandas as pd
import numpy as np

In [7]:
books=pd.read_csv(data_path+"\Books.csv")
books.head()

C:\Users\djdeb\AppData\Local\Temp\ipykernel_3564\2130499720.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books=pd.read_csv(data_path+"\Books.csv")

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [8]:
books.shape

(271360, 8)

In [9]:
books['ISBN'].nunique()

271360

Observation 1: All the books are unique

In [10]:
books['Book-Author'].nunique()

102022

Observation 2: Some authors are having more than 1 books

In [11]:
books['Book-Title'].nunique()

242135

Observation 3: Some books title are same

In [12]:
books['Year-Of-Publication'].nunique()

202

In [13]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271358 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271358 non-null  object
 5   Image-URL-S          271360 non-null  object
 6   Image-URL-M          271360 non-null  object
 7   Image-URL-L          271357 non-null  object
dtypes: object(8)
memory usage: 16.6+ MB

Observation 4: Some publishers name is missing

In [15]:
books['Publisher']=books['Publisher'].fillna(value='most-frequent')

In [16]:
books['Publisher'].isnull().sum()

np.int64(0)

In [17]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271358 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271360 non-null  object
 5   Image-URL-S          271360 non-null  object
 6   Image-URL-M          271360 non-null  object
 7   Image-URL-L          271357 non-null  object
dtypes: object(8)
memory usage: 16.6+ MB

In [18]:
columns=['ISBN','Book-Title','Book-Author','Year-Of-Publication','Publisher','Image-URL-M']
books_df=books[columns]

In [19]:
books_df

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-M
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...
...,...,...,...,...,...,...
271355,0440400988,There's a Bat in Bunk Five,Paula Danziger,1988,Random House Childrens Pub (Mm),http://images.amazon.com/images/P/0440400988.0...
271356,0525447644,From One to One Hundred,Teri Sloat,1991,Dutton Books,http://images.amazon.com/images/P/0525447644.0...
271357,006008667X,Lily Dale : The True Story of the Town that Ta...,Christine Wicker,2004,HarperSanFrancisco,http://images.amazon.com/images/P/006008667X.0...
271358,0192126040,Republic (World's Classics),Plato,1996,Oxford University Press,http://images.amazon.com/images/P/0192126040.0...
271359,0767409752,A Guided Tour of Rene Descartes' Meditations o...,Christopher Biffle,2000,McGraw-Hill Humanities/Social Sciences/Languages,http://images.amazon.com/images/P/0767409752.0...

In [24]:
books_df=books_df.astype('str')

In [27]:
books_df['Book-Author']=books_df['Book-Author'].apply(lambda x: ''.join(x.split()))

In [28]:
books_df['Publisher']=books_df['Publisher'].apply(lambda x: ''.join(x.split()))

In [29]:
books_df.sample(3)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-M
167079,0517101076,The Search for the Perfect Chocolate Chip Cookie,GWENSTEEGE,2003,Gramercy,http://images.amazon.com/images/P/0517101076.0...
196610,0373201613,Man She Married (By Request) (By Request),AnnMajor,1999,Harlequin,http://images.amazon.com/images/P/0373201613.0...
270153,1854879308,Satin and Lace,DanielleShaw,1997,LondonBridge,http://images.amazon.com/images/P/1854879308.0...

In [36]:
books_df['tag']=books_df['Book-Title']+' '+ books_df['Book-Author']+' '+books_df['Year-Of-Publication']+' '+books_df['Publisher']

In [34]:
from sklearn.feature_extraction.text import TfidfVectorizer,CountVectorizer

In [2]:
# vectorizer = CountVectorizer(stop_words='english',max_features=1000)

In [3]:
# books_vectors=vectorizer.fit_transform(books_df['tag']).toarray()

In [4]:
# vectorizer.get_feature_names_out

In [5]:
# books_vectors.shape

In [62]:
from sklearn.metrics.pairwise import cosine_similarity

In [1]:
# similarity_matrix = cosine_similarity(books_vectors)

In [64]:
ratings_df=pd.read_csv('data\Ratings.csv')

In [65]:
ratings_df

         User-ID         ISBN  Book-Rating
0         276725   034545104X            0
1         276726   0155061224            5
2         276727   0446520802            0
3         276729   052165615X            3
4         276729   0521795028            6
...          ...          ...          ...
1149775   276704   1563526298            9
1149776   276706   0679447156            0
1149777   276709   0515107662           10
1149778   276721   0590442449           10
1149779   276723  05162443314            8

[1149780 rows x 3 columns]

In [67]:
users_df=pd.read_csv(r'data\Users.csv')
users_df

        User-ID                            Location   Age
0             1                  nyc, new york, usa   NaN
1             2           stockton, california, usa  18.0
2             3     moscow, yukon territory, russia   NaN
3             4           porto, v.n.gaia, portugal  17.0
4             5  farnborough, hants, united kingdom   NaN
...         ...                                 ...   ...
278853   278854               portland, oregon, usa   NaN
278854   278855  tacoma, washington, united kingdom  50.0
278855   278856           brampton, ontario, canada   NaN
278856   278857           knoxville, tennessee, usa   NaN
278857   278858                dublin, n/a, ireland   NaN

[278858 rows x 3 columns]